websevice1/result1/Iteration1/t1_RequestBody.txt

<?xml version="1.0" encoding="utf-8"?><soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/03/addressing"><soap:Header><wsa:Action>http://WebXml.com.cn/getDomesticCity</wsa:Action><wsa:MessageID>uuid:bdc19f55-4e2e-4b3c-a65d-1a6910fe32b7</wsa:MessageID><wsa:ReplyTo><wsa:Address>http://schemas.xmlsoap.org/ws/2004/03/addressing/role/anonymous</wsa:Address></wsa:ReplyTo><wsa:To>http://ws.webxml.com.cn/webservices/DomesticAirline.asmx</wsa:To></soap:Header><soap:Body><getDomesticCity xmlns="http://WebXml.com.cn/" /></soap:Body></soap:Envelope>