app/src/flight.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Body>
    <getDomesticAirlinesTime xmlns="http://WebXml.com.cn/">
      <startCity>startCityTmp</startCity>
      <lastCity>lastCityTmp</lastCity>
      <theDate></theDate>
      <userID></userID>
    </getDomesticAirlinesTime>
  </soap:Body>
</soap:Envelope>