xml/getDomesticCityReq.xml

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:web="http://WebXml.com.cn/">
   <soap:Header/>
   <soap:Body>
      <web:getDomesticCity/>
   </soap:Body>
</soap:Envelope>